app/controllers/songs_controller.rb

  def index
      if params[:artist_id]
        if Artist.find_by(id: params[:artist_id])
          @songs = Artist.find(params[:artist_id]).songs
        else
          flash[:alert] = "Artist not found"
          redirect_to artists_path
        end
      else
        @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"

  def show
    if Song.find_by(id: params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]